// Задача 1: Задайте значения M и N. 
// Напишите программу, которая выведет все натуральные числа
//  в промежутке от M до N. Использовать рекурсию, не использовать циклы.

// int firstElement = 4;
// int secondElements = 15;

// PrintNumbers(firstElement,secondElements);

// void PrintNumbers(int startElement,int endElement)
// {
//    System.Console.WriteLine(startElement);

//    if(endElement <= startElement)
//    {
//       return;
//    }

//    PrintNumbers(startElement+1, endElement);
// }



// Задача 2: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.

// Задача 3: Задайте произвольный массив. Выведете его элементы, начиная с конца. Использовать рекурсию, не использовать циклы.